IDENTIFICATION DIVISION.
PROGRAM-ID. MEZCLA_COBOL.
AUTHOR. LUGO GARCIA JULIO CESAR.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. A1000.
OBJECT-COMPUTER. A1000.
SPECIAL-NAMES.
      CHANNEL 1 IS SALTO.

INPUT-OUTPUT SECTION.
FILE-CONTROL.
******
******Archivos a utilizar durante todo el programa
******
      SELECT MAESTRO1 ASSING TO READERS.
      SELECT MOVIMIENTO ASSING TO READERS.
      SELECT MAESTRO2 ASSING TO PRINTER.
      SELECT ERROR ASSING TO PRINTER.

DATA DIVISION.
FILE SECTION.
FD MAESTRO1.
      RECORD CONTAINS 70 CHARACTERS
      DATA RECORD IS MTO1.
FD MOVIMIENTO.
      RECORD CONTAINS 70 CHARACTERS
      DATA RECORD IS MOV.

01 MTO1.
      02 B PIC 99999.
      02 C PIC X(30).
      02 D PIC 99999.
      02 FILLER PIC X(30).

03 MOV.
      04 F PIC 99999.
      04 G PIC X(30).
      04 H PIC 99999.
      04 I PIC A.
      04 FILLER PIC X(29).

FD  MAESTRO2
      DATA RECORD IS MTO2.

FD ERROR
      DATA RECORD IS ERR.

06 MTO2.
      07 FILLERPIC X(10).
      07 B-I PIC 99999.
      07 FILLER PIC X(5).
      07 C-I PIC X(30).
      07 FILLER PIC 99999.
      07 D-I PIC 99999.
      07 FILLER PIC X(10).

08 ERR.
      09 FILLERPIC X(7).
      09 B-I PIC 99999.
      09 FILLER PIC X(5).
      09 C-I PIC X(30).
      09 FILLER PIC X(5).
      09 D-I PIC 99999.
      09 FILLER PIC X(5).
      09 E-I PIC A.
      09 FILLER PIC X(7).

WORKING-STORAGE SECTION.

77    X PIC 999V9 VALUE ZEROS.
77    NOMBRE PIC X(6) VALUE "NOMBRE".
77    NOCUNETA PIC X(8) VALUE "NOCUNETA".
77    NOCREDIT PIC X(8) VALUE "NOCREDIT".
77    TIPO PIC X(4) VALUE "TIPO".

10 TITULO.
      11 FILLER PIC X(10) VALUE SPACES.
      11 FILLER PIC X(20) VALUE "MEXCLA DE ARCHIVOS".

12 TITULO2.
      13 FILLER PIC X(10) VALUE SPACES.
      13 FILLER PIC X(20) VALUE "ERRORES".

PROCEDURE DIVISION.

INICIO.

****
****APERTURA DE LOS ARCHIVOS DE ENTRADA Y SALIDA
****
      OPEN INPUT MAESTRO1
      OPEN INPUT MOVIMIENTO.
      OUTPUT MAESTRO2.
      OUTPUT ERROR.

      LEE-MTO1.
****
****COLOCANDO EL TITULO EN AMBAS SALIDAS,
****
      MOVE TITULO TO MAESTRO2.
      WRITE IMP AFTER SALTO.
      MOVE SPACES TO IMP.

      READ MAESTRO1 AT END GO TO FIN-LEE.MTO1.

LEE-MOV.
      READ MOVIMIENTO AT END GO TO FIN-LEE-MOV.

****
****INICIO DE LOS CICLOS.
****

INICIO-CICLO.
      IF B = 0 AND F = 0
      GO TO END.
RECURSIVIDAD.

      IF B>F
      GOTO DIEZ.

      IF B<F AND I = "A"
      GO TO VEINTE.

      IF B<F AND I = "B"
      GO TO TREINTA.

      IF B<F AMD I = "C"
      GO TO CUARENTA.

      IF B<F AND I NON EQUAL "A" OR "B" OR "C"
      GO TO OCHENTA.

 DIEZ.
      MOVE B TO B-I.
      MOVE C TO C-I.
      MOVE D TO D-I.
      WRITE MAESTRO1 TO MAESTRO2.
      READ MAESTRO1 AT END GOTO FIN-LEE-MTO1.
      GO TO END_CICLO.

VEINTE.
      MOVE F TO B-I.
      MOVE G TO C-I.
      MOVE H TO D-I.
      WRITE MOVIMIENTO TO MAESTRO2.
      READ MAESTRO1 AT END GOTO FIN-LEE-MOV.
      GOTO END_CICLO.

TREINTA.
      MOVE F TO B-I.
      MOVE G TO C-I.
      MOVE H TO D-I.
      WRITE MOVIMIENTO TO ERROR.
      READ MOVIMIENTO AT END GO TO FIN-LEE-MOV.
      GO TO END_CICLO.

CUARENTA.

OCHENTA.

END MEZCLA_COBOL.
